In [64]:
import numpy as np
import pandas as pd

In [65]:
labels = ["Dishawasher", "Coffee maker", "Laptop", "Smartphone"]
prices = [399, 129, 899, 499]
# two lists into a panda series

ser1 = pd.Series(prices, labels)
ser1.to_frame()
#to_frame() to convert a series into DataFrame -> prettier printing in Jupyter

                0
Dishawasher   399
Coffee maker  129
Laptop        899
Smartphone    499

In [66]:
# only commmon values are added together, the rest will show as NaN -> Not a Number
ser1 = pd.Series([1, 2, 3], ['Finland', 'Sweden', 'Norway'])
ser2 = pd.Series([1, 2, 4], ['Finland', 'Sweden', 'Denmark'])

# the resulting series will be sorted alphabetically
combined = ser1 + ser2
combined.to_frame()

           0
Denmark  NaN
Finland  2.0
Norway   NaN
Sweden   4.0

Data frames - Main feature of pandas

In [67]:
# lock down the random seed to get the same results every time
from numpy.random import randint
np.random.seed(321)

companies = ['Jolly Good Toys Ltd',
            'Pristine Machines Inc.',
            'Piggy Bank Corporation',
            'Cars & Gears Foundation']

sales = ["Europe", "North_America", "South_America", "Asia", "Africa", "Other"]

# generate the "random" sales numbers with the locked seed
numbers = randint(99999, size=(4, 6))

df = pd.DataFrame(numbers, companies, sales)

In [68]:
df

,Europe,North_America,South_America,Asia,Africa,Other
Jolly Good Toys Ltd,97268,6682,4220,43807,5929,91537
Pristine Machines Inc.,24744,69018,99288,14068,90469,94536
Piggy Bank Corporation,28243,44245,21633,78619,45594,37389
Cars & Gears Foundation,57643,46518,71742,99722,48613,97335

In [69]:
col_df = df["Europe"]
col_df.to_frame()

                         Europe
Jolly Good Toys Ltd       97268
Pristine Machines Inc.    24744
Piggy Bank Corporation    28243
Cars & Gears Foundation   57643

In [70]:
df["Both_Americas"] = df["North_America"] + df["South_America"]
df

,Europe,North_America,South_America,Asia,Africa,Other,Both_Americas
Jolly Good Toys Ltd,97268,6682,4220,43807,5929,91537,10902
Pristine Machines Inc.,24744,69018,99288,14068,90469,94536,168306
Piggy Bank Corporation,28243,44245,21633,78619,45594,37389,65878
Cars & Gears Foundation,57643,46518,71742,99722,48613,97335,118260

In [71]:
df = df.drop('South_America', axis=1)

In [72]:
df = df.drop('North_America', axis=1)

In [73]:
df

                         Europe   Asia  Africa  Other  Both_Americas
Jolly Good Toys Ltd       97268  43807    5929  91537          10902
Pristine Machines Inc.    24744  14068   90469  94536         168306
Piggy Bank Corporation    28243  78619   45594  37389          65878
Cars & Gears Foundation   57643  99722   48613  97335         118260

In [74]:
df = df.drop('Piggy Bank Corporation', axis=0)

In [75]:
df

                         Europe   Asia  Africa  Other  Both_Americas
Jolly Good Toys Ltd       97268  43807    5929  91537          10902
Pristine Machines Inc.    24744  14068   90469  94536         168306
Cars & Gears Foundation   57643  99722   48613  97335         118260

In [76]:
row = df.loc['Pristine Machines Inc.']
row.to_frame().transpose()

                        Europe   Asia  Africa  Other  Both_Americas
Pristine Machines Inc.   24744  14068   90469  94536         168306

In [77]:
row = df.iloc[2]
row.to_frame().transpose()

                         Europe   Asia  Africa  Other  Both_Americas
Cars & Gears Foundation   57643  99722   48613  97335         118260

Filtering DataFrames

In [79]:
sub_values = df[df > 40000]
sub_values

                          Europe     Asia   Africa  Other  Both_Americas
Jolly Good Toys Ltd      97268.0  43807.0      NaN  91537            NaN
Pristine Machines Inc.       NaN      NaN  90469.0  94536       168306.0
Cars & Gears Foundation  57643.0  99722.0  48613.0  97335       118260.0